{
  "note_number": "NOTE 10",
  "note_title": "Cash and cash equivalents",
  "output_file": "lifeline_diagnostics_note_10_cash_and_cash_equivalents.txt",
  "statement_type": "balance-sheet",
  "summation_rule": "Sum all related GL accounts algebraically. Cash and cash equivalents are typically debit balances (assets). Present as positive amounts in the balance sheet.",
  "generate_if_empty": true,
  "match_on_minor_only": true,
  "categories": [
    "Bank Balance"
  ],
  "output_format": [
    {
      "label": "Bank Balance",
      "ind_as_minor": "Bank Balance",
      "default_value": 0
    }
  ],
  "additional_instructions": "This note discloses cash and cash equivalents recognized in the balance sheet as per Ind AS 7 - Statement of Cash Flows.\n\n**CRITICAL MATCHING INSTRUCTION**: \nONLY sum GL accounts where the 'Ind AS Minor' column exactly equals 'Bank Balance'.\nDO NOT match on 'Ind AS Major' column or any other column.\nIGNORE accounts that may have 'Cash and cash equivalents' in the Major column but do NOT have 'Bank Balance' in the Minor column.\n\n**Bank Balance**: Sum all GL accounts where Ind AS Minor = 'Bank Balance'. This includes:\n- Cash at bank in current accounts\n- Cash at bank in savings accounts\n- Bank balances in checking accounts\n- Balances with banks on current account\n- Demand deposits with banks\n- Cash and cheques on hand (if included in bank balance)\n- Bank deposits with original maturity of 3 months or less\n- Short-term highly liquid investments readily convertible to known amounts of cash\n- Bank overdrafts repayable on demand (shown as negative if applicable)\n\nCash and cash equivalents comprise cash at bank and on hand, and short-term deposits with an original maturity of three months or less, which are subject to an insignificant risk of changes in value.\n\nDefinition as per Ind AS 7:\nCash equivalents are held for the purpose of meeting short-term cash commitments rather than for investment or other purposes. For an investment to qualify as a cash equivalent, it must be readily convertible to a known amount of cash and be subject to an insignificant risk of changes in value.\n\nMatching Logic:\n- Column to match: 'Ind AS Minor' ONLY\n- Value to match: 'Bank Balance' (exact match)\n- DO NOT use 'Ind AS Major' column for matching\n\nPresentation Notes:\n1. Cash and cash equivalents are current assets\n2. Present as positive amounts (debit balances)\n3. Highly liquid and readily available for use\n4. Include only balances available for immediate use\n5. Exclude restricted cash or deposits with maturity > 3 months\n6. Follow Schedule III format for balance sheet presentation\n7. Bank overdrafts may be included if they form an integral part of cash management\n\nSchedule III Compliance:\nThis format follows Schedule III of Companies Act, 2013 requirements for cash and cash equivalents disclosure. Additional disclosures may be required:\n- Details of bank balances (name of banks, account types)\n- Balances held in foreign currency\n- Balances not available for use (earmarked, restricted)\n- Bank overdrafts (if netted or shown separately)\n- Deposits with original maturity > 3 months but ≤ 12 months (shown under Other Bank Balances)\n\nInd AS 7 Requirements:\n- Cash and cash equivalents must be readily convertible to known amounts of cash\n- Original maturity must be 3 months or less\n- Must be subject to insignificant risk of changes in value\n- Reconciliation between balance sheet and cash flow statement\n\nExclusions (to be shown separately if applicable):\n- Fixed deposits with maturity > 3 months\n- Margin money deposits\n- Earmarked balances for specific purposes\n- Restricted cash or pledged deposits\n- Balances with banks held as security\n\nIMPORTANT: Always generate this note even if no matching accounts are found in the trial balance. Display zero (0) values for all line items when no data is available."
}

